src/Catalogs/уатРаботыПоРемонту/уатРаботыПоРемонту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатРаботыПоРемонту</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>Номер автоработы по каталогу</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование автоработы</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>Базовая номенклатура автоработы</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/уатЗаполнениеНоменклатурыПриСозданииРаботПоРемонту/уатЗаполнениеНоменклатурыПриСозданииРаботПоРемонту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатЗаполнениеНоменклатурыПриСозданииРаботПоРемонту</name>
  <enumValues>
    <name>НеСоздавать</name>
  </enumValues>
  <enumValues>
    <name>Создавать</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьОбщую</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр) Весовой коэффициент вхождения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидГруза</name>
    <type>
      <types>CatalogRef.уатВидыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидУпаковкиДляРоссыпи</name>
    <type>
      <types>CatalogRef.уатВидыУпаковки_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидУпаковкиОсновной</name>
    <type>
      <types>CatalogRef.уатВидыУпаковки_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>уатКоличествоВОсновнойУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатКоличествоВУпаковкеДляРоссыпи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаРегл</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЭтикетокДляКаждойЕдиницыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатРаботыПоРемонту/ObjectModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);
	
	Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("Номенклатура",1);
	КонецЕсли;
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

Процедура ПередЗаписью(Отказ)   
	
	Если Не ЗначениеЗаполнено(Номенклатура) И Не ЭтоГруппа Тогда 
		Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		ОсновнаяОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяОрганизация");
		РежимЗаполненияНоменклатуры = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ОсновнаяОрганизация, ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ЗаполнениеНоменклатурыПриСозданииРаботПоРемонтуТС"));
		
		Если РежимЗаполненияНоменклатуры = Перечисления.уатЗаполнениеНоменклатурыПриСозданииРаботПоРемонту.Создавать Тогда
			ГруппаНоменклатурыДляРаботПоРемонтуТС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ОсновнаяОрганизация, ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ГруппаНоменклатурыДляРаботПоРемонтуТС"));
			
			НовыйЭлемент 					= Справочники.Номенклатура.СоздатьЭлемент();
			НовыйЭлемент.Наименование 		= Наименование;
			НовыйЭлемент.НаименованиеПолное = НаименованиеПолное;
			НовыйЭлемент.Родитель 			= ГруппаНоменклатурыДляРаботПоРемонтуТС;
			НовыйЭлемент.ВидНоменклатуры	= Справочники.ВидыНоменклатуры.Услуга;
			
			Попытка
				НовыйЭлемент.Записать();
			Исключение 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки; 
			
			Номенклатура = НовыйЭлемент.Ссылка;
		ИначеЕсли РежимЗаполненияНоменклатуры = Перечисления.уатЗаполнениеНоменклатурыПриСозданииРаботПоРемонту.ЗаполнятьОбщую Тогда	
			ОбщаяНоменклатура = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ОсновнаяОрганизация, ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ОбщаяНоменклатураДляЗаполненияРаботПоРемонтуТС"));
			Номенклатура = ОбщаяНоменклатура;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
